/***************************
**  contId  :  广告容器 jQuery的DOM元素查找表达式。 如：#divIde,   .divClass,   .pjCon5 ul li:eq(0)
**  adId    :  广告ID
**  adType  :  广告类型  0：轮播图  1：单张图片显示  2：单张图片显示，带有关闭按钮（目前只有顶通广告）
**  注意-1  :  <<contId切记出现重复，切记，切记，切记>>
**  注意-2  :  <<修改程序时请一并修改相应注释，方便你我他，佛祖会保佑你的>>
****************************/
var adList = [
	/*************************************----顶通广告----*****************************************/
	{"contId":".toppic", "adId":"7114", "adType":"2"},//网站--顶通广告
	/*************************************----登陆页----*****************************************/
	{"contId":"#leftImgBann", "adId":"10695", "adType":"0"},//登陆页--左侧大广告
	/*************************************------首页------*****************************************/
	{"contId":".adSlider", "adId":"7003", "adType":"1"},//首页--头部大广告轮播图
	{"contId":"#ad-1", "adId":"7091", "adType":"0"},//首页--大广告轮播图下方横排5个小广告位--01
	{"contId":"#ad-2", "adId":"7107", "adType":"0"},//首页--大广告轮播图下方横排5个小广告位--02
	{"contId":"#ad-3", "adId":"7108", "adType":"0"},//首页--大广告轮播图下方横排5个小广告位--03
	{"contId":"#ad-4", "adId":"7109", "adType":"0"},//首页--大广告轮播图下方横排5个小广告位--04
	{"contId":"#ad-5", "adId":"7110", "adType":"0"},//首页--大广告轮播图下方横排5个小广告位--05
	{"contId":"#jiuul2_1", "adId":"7111", "adType":"0"},//首页--大广告轮播图下方横排3个广告位--01
	{"contId":"#jiuul2_2", "adId":"7112", "adType":"0"},//首页--大广告轮播图下方横排3个广告位--02
	{"contId":"#jiuul2_3", "adId":"7113", "adType":"0"},//首页--大广告轮播图下方横排3个广告位--03
	{"contId":"#videoImg", "adId":"13851", "adType":"0"},//首页--右侧中部视讯广告位
	{"contId":"#videoBottom", "adId":"7148", "adType":"0"},//首页--视讯下方广告位
	{"contId":"#gotop_1", "adId":"7137", "adType":"0"},//首页--左侧单张广告图 - 套装礼盒
	{"contId":"#gotop_2", "adId":"7138", "adType":"0"},//首页--左侧单张广告图 - 获奖名酒
	{"contId":"#gotop_3", "adId":"7139", "adType":"0"},//首页--左侧单张广告图 - 西班牙
	{"contId":"#gotop_4", "adId":"7140", "adType":"0"},//首页--左侧单张广告图 - 法国
	{"contId":"#gotop_5", "adId":"7141", "adType":"0"},//首页--左侧单张广告图 - 口感
	{"contId":"#imgbox_1", "adId":"7115", "adType":"0"},//首页--网站通栏-01--上
	{"contId":"#imgbox_2", "adId":"7116", "adType":"0"},//首页--网站通栏-02--下
	{"contId":"#bottomAd_1", "adId":"7161", "adType":"0"},//首页--底部广告-01
	{"contId":"#bottomAd_2", "adId":"7162", "adType":"0"},//首页--底部广告-02
	{"contId":"#bottomAd_3", "adId":"7163", "adType":"0"},//首页--底部广告-03
	{"contId":"#bottomAd_4", "adId":"7170", "adType":"0"},//首页--底部广告-04
	/*************************************------礼品卡------*****************************************/
	{"contId":"#card_topBann", "adId":"16829", "adType":"0"},//礼品卡--头部大幅广告
	/*************************************------品鉴会------*****************************************/
	{"contId":".pjTop", "adId":"7183", "adType":"1"},//品鉴会--顶部轮播图
	{"contId":".pjCon5 ul li:eq(0)", "adId":"7190", "adType":"0"},//品鉴会--底部-左边
	{"contId":".pjCon5 ul li:eq(1)", "adId":"7191", "adType":"0"},//品鉴会--底部-中间
	{"contId":".pjCon5 ul li:eq(2)", "adId":"7192", "adType":"0"},//品鉴会--底部-右边
	/*************************************------贵宾通道------*****************************************/
	{"contId":"#slidImg", "adId":"7213", "adType":"1"},//贵宾通道--上右部轮播图
	{"contId":"#banH", "adId":"7214", "adType":"0"},//贵宾通道--横幅广告
	{"contId":"#imgLeft", "adId":"7215", "adType":"0"},//贵宾通道--底部-左边
	{"contId":"#imgRigt", "adId":"7216", "adType":"0"},//贵宾通道--底部-右边
	/*************************************------会员俱乐部------*****************************************/
	{"contId":"#leftBan", "adId":"7227", "adType":"0"},//会员俱乐部--左下方广告
	/*************************************------闪购------*****************************************/
	{"contId":"#slideLeft", "adId":"7239", "adType":"1"},//闪购--上左轮播图
	{"contId":"#slideRight", "adId":"7240", "adType":"1"},//闪购--上右轮播图
	{"contId":"#bann1", "adId":"7268", "adType":"0"},//闪购--右侧-上
	{"contId":"#bann2", "adId":"7284", "adType":"0"},//闪购--右侧-下
	/*************************************------团购------*****************************************/
	{"contId":"#slideBannLeft", "adId":"7300", "adType":"1"},//团购--上左
	{"contId":"#slideBannRigt", "adId":"7301", "adType":"1"},//团购--上右
	{"contId":"#botImg1", "adId":"7312", "adType":"0"},//团购--底部-左
	{"contId":"#botImg2", "adId":"7318", "adType":"0"},//团购--底部-中
	{"contId":"#botImg3", "adId":"7324", "adType":"0"},//团购--底部-右
	/*************************************------商品列表页------*****************************************/
	{"contId":"#right01", "adId":"7340", "adType":"0"},//商品列表页--右侧-01
	{"contId":"#right02", "adId":"7341", "adType":"0"},//商品列表页--右侧-02
	{"contId":"#right03", "adId":"7342", "adType":"0"},//商品列表页--右侧-03
	{"contId":"#right04", "adId":"7343", "adType":"0"},//商品列表页--右侧-04
	{"contId":"#right05", "adId":"7344", "adType":"0"},//商品列表页--右侧-05
	/*************************************------会员中心------*****************************************/
	{"contId":"#hyImg01", "adId":"7351", "adType":"0"},//会员中心--底部-左
	{"contId":"#hyImg02", "adId":"7352", "adType":"0"},//会员中心--底部-中
	{"contId":"#hyImg03", "adId":"7353", "adType":"0"},//会员中心--底部-右
	/*************************************------资讯页面------*****************************************/
	{"contId":"#vListImg", "adId":"7354", "adType":"0"},//资讯页面--右-上
	/*************************************------资讯详情------*****************************************/
	{"contId":"#bannImg", "adId":"7355", "adType":"0"}//资讯详情--右-上
	/*************************************------自由经理人------*****************************************/
];

$(function (){
	for(var i=0,j=adList.length; i<j; i++){
		var htmlDom = $(adList[i].contId);
		if(htmlDom.length > 0){
			htmlDom.adSlider({adId:adList[i].adId, type:adList[i].adType});
		}
	}
})























